validation-results/adr-016-h100-spec/pilot/bench.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72853572b6a0>, trust_remote_code=False, seed=42, num_prompts=60, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='Qwen/Qwen2.5-3B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9fad8ef6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-03 18:51:57 [utils.py:90] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 60/60 [00:18<00:00,  3.29it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     60        
Failed requests:                         0         
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  18.24     
Total input tokens:                      32460     
Total generated tokens:                  15360     
Request throughput (req/s):              3.29      
Output token throughput (tok/s):         842.02    
Peak output token throughput (tok/s):    1277.00   
Peak concurrent requests:                52.00     
Total token throughput (tok/s):          2621.45   
---------------Time to First Token----------------
Mean TTFT (ms):                          2795.30   
Median TTFT (ms):                        2559.98   
P99 TTFT (ms):                           7747.88   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.09     
Median TPOT (ms):                        15.42     
P99 TPOT (ms):                           27.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           44.75     
Median ITL (ms):                         35.70     
P99 ITL (ms):                            215.28    
---------------Speculative Decoding---------------
Acceptance rate (%):                     40.00     
Acceptance length:                       3.00      
Drafts:                                  5100      
Draft tokens:                            25500     
Accepted tokens:                         10200     
Per-position acceptance (%):
  Position 0:                            100.00    
  Position 1:                            100.00    
  Position 2:                            0.00      
  Position 3:                            0.00      
  Position 4:                            0.00      
==================================================